app/views/home/index.html.erb

SELECT "tweets".* FROM "tweets"
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "follows" WHERE "follows"."follower" = ?  [["follower", 6]]
SELECT COUNT(*) FROM "follows" WHERE "follows"."followed" = ?  [["followed", 3]]
---
            <tr>
              <td><%= link_to @user.tweets.count, "/tweets" %></td>
              <td><%= link_to @user.follower.count, "/following" %></td>
              <td><%= link_to @user.followed.count, "/followers" %></td>

SELECT "replies".* FROM "replies" WHERE "replies"."tweet_id" = ?  [["tweet_id", 1]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."tweet_id" = ?  [["tweet_id", 1]]
---

          <% if tweet.replys.count > 0 %>