app/controllers/follow_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "follows" ("followed", "follower") VALUES (?, ?)  [["followed", 3], ["follower", 5]]
---
   def create
    @follow = Follow.new
    @follow.followed_id =params["id"]
    @follow.follower_id =session[:user_id]
    follow_user = User.find(params["id"])
    @search_text = params[:search_text]
    if @follow.save

SELECT  "follows".* FROM "follows" WHERE "follows"."followed" = ? LIMIT 1  [["followed", 3]]
---
  def followers
     @follows = Follow.where(:followed => session[:user_id])

SELECT "follows".* FROM "follows" WHERE "follows"."follower" = ?  [["follower", 6]]
---
  def following
     @follows = Follow.where(:follower => session[:user_id])