app/controllers/home_controller.rb

  def index
  	if session[:user_id]
		@user = User.find(session[:user_id])
  	end
  	@tweet = Tweet.all

  	@tweet = @tweet.page(params[:page]).per(4)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "tweets".* FROM "tweets"
SELECT  "tweets".* FROM "tweets" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "tweets"