app/controllers/messages_controller.rb

INSERT INTO "direct_messages" ("message", "create_time", "sender_id") VALUES (?, ?, ?)  [["message", "test"], ["create_time", "2015-08-11 01:47:42.040095"], ["sender_id", 1]]
SELECT  "users".* FROM "users" WHERE (6) LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."user_name" IS NULL LIMIT 1
---
  def create
    @message = DirectMessage.new
    @message.message = params[:message]
    @message.create_time = DateTime.now
    @message.sender_id = User.find_by(session[:user_id])
    @message.receiver_id = User.find_by(:user_name => params["receiver"])

SELECT "direct_messages".* FROM "direct_messages" WHERE "direct_messages"."receiver_id" = ?  [["receiver_id", 6]]
---
  def index
    @messages = DirectMessage.where(:receiver_id => session[:user_id])