app/controllers/search_controller.rb

SELECT "users".* FROM "users"
---
  def users
    @users = User.all