app/controllers/user_controller.rb

  def new
    @user = User.new
    logger.debug User.count.to_s
---
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new
    @user.user_name = params[:user_name]
    @user.password = params[:password]
    @user.name = params[:name]
    @user.email = params[:email]
    @user.photo_url = params[:photo_url]
    if @user.save
---
INSERT INTO "users" ("user_name", "password", "name", "email", "photo_url") VALUES (?, ?, ?, ?, ?)  [["user_name", "me"], ["password", "Password"], ["name", "Mathew Philip"], ["email", "asdas"], ["photo_url", "acs"]]