app/controllers/users_controller.rb

  def find_user
    @user = User.find(params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

  def update
    @user.name = params[:name]
    @user.email = params[:email]
    @user.save
---
UPDATE "users" SET "name" = ?, "email" = ? WHERE "users"."id" = ?  [["name", "d7"], ["email", "d7@example.org"], ["id", 8]]

  def new
    @user = User.new
    logger.debug User.count.to_s
---
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new
    @user.user_name = params[:user_name]
    @user.password = params[:password]
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:photo_url] && params[:photo_url]  =~ URI::regexp
      @user.photo_url = params[:photo_url]
    else
      #For now only one default profile picture if user did not provide any..
      @user.photo_url = "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTCpsIUaW7-mVvrpYcplicOo_EEbVUUJfP379hY-bSCHyGCnkeJ"
      puts @user.photo_url
    end
    if @user.save
---
INSERT INTO "users" ("user_name", "password_digest", "name", "email", "photo_url") VALUES (?, ?, ?, ?, ?)  [["user_name", "d"], ["password_digest", "$2a$10$VkeRJkgv9UA/p7Qx2kzF7OI0z/ZiNtHjs6qf57CP0yiSnaD/btBvW"], ["name", "d"], ["email", "d@twitter.com"], ["photo_url", ""]]

  def destroy
    @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]