app/views/follow/following.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
<% @follows.each do |follow| %>
  <% user = User.find(follow.followed) %>